---
kind: method
id: M:Autodesk.Revit.UI.Events.TextBoxEnterPressedEventArgs.#ctor
source: html/de693cc6-d861-28f1-10db-8e45b7bdb00e.htm
---
# Autodesk.Revit.UI.Events.TextBoxEnterPressedEventArgs.#ctor Method

Initializes a new instance of the TextBoxEnterPressedEventArgs class

## Syntax (C#)
```csharp
public TextBoxEnterPressedEventArgs()
```